index=botsv3 earliest=0 sourcetype="stream:http"
src_ip="192.168.8.103" http_method=POST
| rex field=form_data "cmd='(?P<command>[^']+)'"
| search command="*nc*" OR command="*backpipe*"
| where NOT like(command,"echo%")
| table _time, command
| sort _time